app/controllers/comments_controller.rb

   def create
    @comment = current_user.comments.new(params[:comment])
    if @comment.save
---
INSERT INTO "comments" ("created_at", "updated_at", "text", "ticket_id") VALUES('2009-06-26 22:03:48', '2009-06-26 22:03:48', 'ljlskdjlskdjlksdjf', 1)

  def destroy
    @comment.destroy
---
DELETE FROM "comments" WHERE "id" = 6