app/controllers/projects_controller.rb

  def create
    @project = current_user.projects.new(params[:project])
    if @project.save
---
INSERT INTO "projects" ("name", "created_at", "updated_at", "url", "info", "active") VALUES('Farm Manager', '2009-06-26 19:47:56', '2009-06-26 19:47:56', NULL, NULL, 't')

  def update
    params[:project] ||= {}
    params[:project].merge!(:active => !@project.active) if params[:toggle]

    if @project.update_attributes(params[:project])
---
UPDATE "projects" SET "info" = 'A project for managing cattle and doing other crazy things', "updated_at" = '2009-06-26 13:16:41' WHERE "id" = 4

  def destroy
    name = @project.name
    @project.destroy
---
DELETE FROM "projects" WHERE "id" = 9