app/controllers/project_users_controller.rb

  def user_request
    project = Project.find(params[:project_id])
    user = User.find(params[:user_id])
    if project && user
      if user.projects.include?(project) || user.requested_projects.include?(project)
        flash[:error] = "You are already on this project" if user.projects.include?(project)
        flash[:error] = "You have already requested to join this project" if user.requested_projects.include?(project)
      else
        ProjectUser.create(:user_id => user.id, :requested_project_id => project.id)
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
SELECT "projects".id FROM "projects" INNER JOIN "project_users" ON "projects".id = "project_users".project_id WHERE ("projects"."id" = 1) AND (("project_users".user_id = 2)) LIMIT 1
INSERT INTO "project_users" ("created_at", "project_id", "updated_at", "user_id", "requested_project_id") VALUES('2009-06-27 19:10:01', NULL, '2009-06-27 19:10:01', 2, 2)

  def accept
    request = ProjectUser.find(params[:id])
    project = request.requested_project
    return not_allowed! unless project.users.include?(current_user)
---
SELECT * FROM "project_users" WHERE ("project_users"."id" = 3)
SELECT * FROM "users" WHERE ("users"."id" = '2') LIMIT 1
SELECT "users".* FROM "users" INNER JOIN "project_users" ON "users".id = "project_users".user_id WHERE (("project_users".project_id = 1))
SELECT * FROM "projects" LIMIT 1

  def reject
    request = ProjectUser.find(params[:id])
    return not_allowed! unless request.requested_project.users.include?(current_user)
    request.destroy
---
SELECT * FROM "project_users" WHERE ("project_users"."id" = 5)
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
SELECT "users".id FROM "users" INNER JOIN "project_users" ON "users".id = "project_users".user_id WHERE ("users"."id" = 1) AND (("project_users".project_id = 2)) LIMIT 1
SELECT * FROM "projects" WHERE ("projects"."id" = 2)
DELETE FROM "project_users" WHERE "id" = 5