app/controllers/tickets_controller.rb

  def index
    if params[:project_id]
      @project = current_user.projects.find(params[:project_id])
---
SELECT "projects".* FROM "projects" INNER JOIN "project_users" ON "projects".id = "project_users".project_id WHERE ("projects"."id" = 10 AND (("project_users".user_id = 1)))

  def create
    @ticket = Ticket.new(params[:ticket].merge!(:project_id => params[:project_id], :user_id => current_user.id))
    if @ticket.save
---
INSERT INTO "tickets" ("on_hold", "created_at", "title", "details", "project_id", "invalid", "high_priority", "updated_at", "user_id", "active") VALUES('f', '2009-06-27 12:04:28', 'bar', 'bar', 1, 'f', NULL, '2009-06-27 12:04:28', 1, 't')

  def update
    before = @ticket.attributes
    if @ticket.update_attributes(params[:ticket])
      after = @ticket.attributes
      changes = before.select{|k,v| !after[k].eql?(v)}
      changes.each do |change|
        next if change.first.eql?("updated_at")
        u = "<a href='users/#{current_user.id}'>#{current_user.username}</a>"
        log = "#{Time.now} - #{u} changed #{change.first}"
        @ticket.change_logs.create!(:log => log)
---
UPDATE "tickets" SET "updated_at" = '2009-06-27 22:34:30', "details" = 'asdasdsdfsdf' WHERE "id" = 2
INSERT INTO "change_logs" ("created_at", "updated_at", "log", "ticket_id") VALUES('2009-06-27 22:52:25', '2009-06-27 22:52:25', '2009-06-27 - Kat changed title', 2)

  def destroy
    project = @ticket.project
    @ticket.destroy
---
DELETE FROM "tickets" WHERE "id" = 1

  def change_status
    @ticket.mark_closed if params[:change_to].eql?('closed')
    @ticket.mark_active if params[:change_to].eql?('active')
    @ticket.mark_on_hold if params[:change_to].gsub(" ", "_").eql?('on_hold')
    @ticket.mark_invalid if params[:change_to].eql?('invalid')
    @ticket.change_logs.create!(:log => "#{Time.now} - #{current_user.username} changed status to #{@ticket.status}")
---
INSERT INTO "change_logs" ("created_at", "updated_at", "log", "ticket_id") VALUES('2009-06-27 22:59:44', '2009-06-27 22:59:44', 'Sat Jun 27 23:59:44 +0100 2009 - Kat changed status to on hold', 3)

  def change_priority
    @ticket.update_attributes(:high_priority => true) if params[:priority].downcase.eql?("high")
    @ticket.update_attributes(:high_priority => nil)  if params[:priority].downcase.eql?("normal")
    @ticket.update_attributes(:high_priority => false)if params[:priority].downcase.eql?("low")
    @ticket.change_logs.create!(:log => "#{Time.now} - #{current_user.username} changed priority to #{@ticket.priority}")
---
UPDATE "tickets" SET "updated_at" = '2009-06-26 14:05:08', "high_priority" = NULL WHERE "id" = 1
INSERT INTO "change_logs" ("created_at", "updated_at", "log", "ticket_id") VALUES('2009-06-27 22:59:15', '2009-06-27 22:59:15', 'Sat Jun 27 23:59:14 +0100 2009 - Kat changed priority to High', 3)