app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "username", "password_salt", "persistence_token", "sys_admin", "email") VALUES('2009-06-27 10:57:55', '2ea1c3592f77a667759a3b7b85e9e82be54876d7f1351434f87110d80958deab009957c7ec3bdf3e6acc46d96e1fb76d3c4c75a55d9b7825fd538dabb9685521', '2009-06-27 10:57:55', 'jim', 'LAGUYAFQTMCd-C7v9GGw', '3c8bf2625e37cd0a56975c45ac4c25c57bf9bd80dcca169811370450032f9ee5cc0548298709dcda63c799361132fc5f826911c8af6b8e7b3a64ecf946bd93d5', 'f', 'jim@jim.com')