app/controllers/welcome_controller.rb

  def index
    if current_user
      @active_projects = current_user.projects.active
      @latest_tickets = current_user.tickets.active.find(:all, :order => "created_at DESC")
---
SELECT "projects".* FROM "projects" INNER JOIN "project_users" ON "projects".id = "project_users".project_id WHERE (("project_users".user_id = 1)) AND (("projects"."active" = 't') AND (("project_users".user_id = 1)))
SELECT "tickets".* FROM "tickets" WHERE ("tickets".project_id IN (1,2))